{"class_name": "Functional", "config": {"name": "model_72", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 140], "dtype": "int64", "sparse": false, "ragged": false, "name": "input"}, "name": "input", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"name": "embedding_92", "trainable": true, "batch_input_shape": [null, 140], "dtype": "float32", "input_dim": 22, "output_dim": 21, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 140}, "name": "embedding_92", "inbound_nodes": [[["input", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_524", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [7], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_524", "inbound_nodes": [[["embedding_92", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_513", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_513", "inbound_nodes": [[["conv1d_524", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_258", "trainable": true, "dtype": "float32", "strides": [3], "pool_size": [3], "padding": "valid", "data_format": "channels_last"}, "name": "max_pooling1d_258", "inbound_nodes": [[["activation_513", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_525", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [7], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_525", "inbound_nodes": [[["max_pooling1d_258", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_514", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_514", "inbound_nodes": [[["conv1d_525", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_259", "trainable": true, "dtype": "float32", "strides": [3], "pool_size": [3], "padding": "valid", "data_format": "channels_last"}, "name": "max_pooling1d_259", "inbound_nodes": [[["activation_514", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_526", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_526", "inbound_nodes": [[["max_pooling1d_259", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_515", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_515", "inbound_nodes": [[["conv1d_526", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_527", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_527", "inbound_nodes": [[["activation_515", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_516", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_516", "inbound_nodes": [[["conv1d_527", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_528", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_528", "inbound_nodes": [[["activation_516", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_517", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_517", "inbound_nodes": [[["conv1d_528", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_529", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_529", "inbound_nodes": [[["activation_517", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_518", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_518", "inbound_nodes": [[["conv1d_529", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_260", "trainable": true, "dtype": "float32", "strides": [3], "pool_size": [3], "padding": "valid", "data_format": "channels_last"}, "name": "max_pooling1d_260", "inbound_nodes": [[["activation_518", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_76", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_76", "inbound_nodes": [[["max_pooling1d_260", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_213", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_213", "inbound_nodes": [[["flatten_76", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_142", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "name": "dropout_142", "inbound_nodes": [[["dense_213", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_214", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_214", "inbound_nodes": [[["dropout_142", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_143", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "name": "dropout_143", "inbound_nodes": [[["dense_214", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_215", "trainable": true, "dtype": "float32", "units": 2, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_215", "inbound_nodes": [[["dropout_143", 0, 0, {}]]]}], "input_layers": [["input", 0, 0]], "output_layers": [["dense_215", 0, 0]]}, "keras_version": "2.9.0", "backend": "tensorflow"}